# Add Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportLinetypeTable..::..Add Method
ExportLinetypeTable Class See Also
---
Inserts a (key, info) pair into Export line type table.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void Add(
	ExportLinetypeKey exportLinetypeKey,
	ExportLinetypeInfo exportLinetypeInfo
)
```

Visual Basic
---
```text
Public Sub Add ( _
	exportLinetypeKey As ExportLinetypeKey, _
	exportLinetypeInfo As ExportLinetypeInfo _
)
```

Visual C++
---
```text
public:
void Add(
	ExportLinetypeKey^ exportLinetypeKey,
	ExportLinetypeInfo^ exportLinetypeInfo
)
```

# ### Parameters
exportLinetypeKey
    Type: Autodesk.Revit.DB..::..ExportLinetypeKey The export line type Key to be added.
exportLinetypeInfo
    Type: Autodesk.Revit.DB..::..ExportLinetypeInfo The export line type info to be added.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The key already exists in the table. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ExportLinetypeTable Class
Autodesk.Revit.DB Namespace